# -*- coding: utf-8 -*- 
# @Time : 2022/6/17 9:20 
# @Author : liqianlan


INTENT_MODEL_SUPPORTS = [("AS升级时，pod状态不正常应该怎么处理", "升级异常-分析类型、原因、处理方法(只有软件，无软件版本）"),
("AS主模块无法升级，etcd出现故障", "升级异常-分析类型、原因、处理方法(只有软件，无软件版本）"),
("AS无法升级， mongodbpod 起不来", "升级异常-分析类型、原因、处理方法(只有软件，无软件版本）"),
("主模块升级后服务启动失败怎么办", "升级异常-分析类型、原因、处理方法(无软件名称、无异常情况名称）"),
("主模块升级后pod状态不正确", "升级异常-分析类型、原因、处理方法(无软件名称、无异常情况名称）"),
("为什么版本回退后服务不可用", "升级异常-分析类型、原因、处理方法(无软件名称、无异常情况名称）"),
("as7023升级到as7024时，MongoDB crash", "软件升级异常分类原因解决方案查询（两个软件版本）"),
("AS7019主模块升级到7020后，etcd的pod异常", "软件升级异常分类原因解决方案查询（两个软件版本）"),
("As7023 到 As7024升级失败，回滚后，有些pod无法启动", "软件升级异常分类原因解决方案查询（两个软件版本）"),
("pod异常的表现有哪些", "异常列表（无具体异常信息）"),
("proton-etcd常见异常有哪些？", "异常列表（无具体异常信息）"),
("proton etcd常见异常有哪些？", "异常列表（无具体异常信息）"),
("Anyshare 7.0.2.0的升级服务是", "软件升级流程查询"),
("AS 7.0.2.2的升级服务是", "软件升级流程查询"),
("AS 7.0.3.2的升级服务是", "软件升级流程查询"),
("主模块升级后pod状态不是running是什么原因", "异常情况-分析类型、原因、处理方法（无软件、有异常情况名称）"),
("解决Pod 处于 Running 状态但是没有正常工作的相关命令有哪些", "异常情况-分析类型、原因、处理方法（无软件、有异常情况名称）"),
("Pod 处于 ImagePullBackOff 状态的异常原因有哪些", "异常情况-分析类型、原因、处理方法（无软件、有异常情况名称）"),]
